Map<String, dynamic> interests = {
  'แฟชั่นหรือไลฟ์สไตล์': [],
  'ประสบการณ์และการเรียนรู้': [],
  'ศิลปะและการออกแบบ': [
    'สถาปัตยกรรม',
    'งานปั้น',
    'งานแกะสลัก',
    'งานหล่อ',
    'งานประกอบขึ้นรูป',
    'งานสัก',
    'การออกแบบ',
    'ภาษาและวรรณกรรม',
    'การพิมพ์ภาพ',
    'ตนตรีนาฏศิลป์',
    'มัณฑนศิลป์',
    'การแสดง',
    'Animating',
    'ดิจิทัลอาร์ต',
    'การถ่ายภาพ'
  ],
  'อาหาร': [
    'การทำอาหาร',
    'การทานอาหาร',
    'ธุรกิจอาหาร',
    'การวิจัยทางอาหาร',
    'การพัฒนาสูตรอาหาร',
    'การปรึกษาโภชนาการ',
    'นวัตกรรมและเทคโนโลยีด้านอาหาร'
  ],
  'กีฬาและสุขภาพ': {
    'ออกกำลังกาย': ['Weight', 'Training', 'Cardio', 'Stretching'],
    'กีฬา': [
      'ลู่ลาน/ความเร็ว',
      'ศิลปะการต่อสู้',
      'ตาข่าย/แร็กเก็ต',
      'ทีม/สนาม',
      'ประกวด',
      'อื่นๆ'
    ]
  },
  'การท่องเที่ยวและสถานที่': [
    'การท่องเที่ยวในประเทศ',
    'แหล่งท่องเที่ยวชื่อดัง',
    'การท่องเที่ยวในประเทศ',
    'มรดกทางวัฒนธรรม',
    'สถานบันเทิง'
  ],
  'สังคมและวัฒนธรรม': [
    'เศรษฐกิจ',
    'วัฒนธรรม',
    'การศึกษา',
    'ครอบครัว',
    'ชนชั้น/ สถานะ/ เครือข่ายการแบ่งชั้นอำนาจ'
  ],
  'สัตว์': [
    'สัตว์บก',
    'สัตว์น้ำ',
    'สัตว์เลื้อยคลาน',
    'แมลง',
    'สัตว์ปีก',
    'สัตว์ครึ่งบกครึ่งน้ำ'
  ],
  'เทคโนโลยี': [
    'วิทยาการคอมพิวเตอร์',
    'วิศวกรรมคอมพิวเตอร์',
    'AI',
    'Cyber Security',
    'IOT',
    'ICT',
    'Metaverse',
    'Blockchain',
    'Robotic',
    'NanoTechnology',
    'Cloud',
    'Quantum Computing',
    'Data'
  ],
  'การแพทย์': [
    'เภสัชวิทยา',
    'ทัตแพทย์ศาสตร์',
    'วิทยาศาสตร์การแพทย์',
    'เลนส์สัมผัส',
    'พิษวิทยา',
    'กุมารเวชศาสตร์',
    'จักษุวิทยา',
    'จิตเวชศาสตร์',
    'พยาธิวิทยา',
    'นิติเวชศาตร์',
    'อายุรศาสตร์',
    'รังสีวิทยา',
    'วิสัญญีวิทยา',
    'เวชศาสตร์ครอบครัว',
    'เวชศาสตร์ป้องกัน',
    'เวชศาสตร์ฟื้นฟู',
    'ศัลยศาสตร์',
    'สูติศาสตร์-นรีเวชวิทยา',
    'โสตศอนาสิกวิทยา (ENT)',
    'ออร์โธปิดิกส์',
    'เวชศาสตร์ฉุกเฉิน (นิติศาสตร์)'
  ],
  'สื่อบันเทิง': [
    'ภาพยนตร์',
    'ดนตรี',
    'ละคร',
    'ซีรีส์',
    'การ์ตูน',
    'เกม',
    'influenser',
    'หนังสือ'
  ],
  'การพัฒนาตนเอง': [
    'ด้านความสามารถ',
    'ด้านทัศนคติ',
    'ด้านการงาน',
    'ด้านความสัมพันธ์',
    'ด้านบุคลิกภาพ',
    'ด้านเป้าหมายและความสำเร็จ',
    'ด้านจิตใจ',
    'ด้านกรอบความคิด'
  ],
  'สิ่งแวดล้อมและธรรมชาติ': [],
  'ปรัชญาและทฤษฎี': [
    'ปรัชญา',
    'อภิชญา',
    'ญาณวิทยา',
    'ไสยศาสตร์นิยม',
    'ตรรกศาสตร์',
    'ปรัชญาโบราณ',
    'ทฤษฎีสมคบคิด'
  ],
  'คณิตศาสตร์': [
    'การคำนวณ',
    'พีชคณิต',
    'เรขาคณิต',
    'ตรีโกณมิติ',
    'แคลตจัง',
    'Number Theory',
    'สถิติและความน่าจะเป็น',
    'Linear Algebra',
    'Differential Equation'
  ],
  'วิทยาศาสตร์': {
    'ฟิสิกส์': [
      'กลศาสตร์',
      'ไฟฟ้าและแม่เหล็ก',
      'เลนส์',
      'ฟิสิกข์นิวเครียร์',
      'เทอร์โมไดนามิกส์',
      'อนุภาค',
      'กลศาสตร์ควอนตัม',
      'ของไหล',
      'ทฤษฎีสัมพันธ์'
    ],
    'เคมี': [
      'เคมีอินทรีย์',
      'เคมีอนินทรีย์',
      'ชีวเคมี',
      'วิศวกรรมเคมี',
      'การวิเคราะห์ทางเคมี'
    ],
    'ชีววิทยา': [
      'พฤกษศาสตร์',
      'สัตววิทยา',
      'จุลวิทยา',
      'พันธุศาสตร์',
      'นิเวศวิทยา',
      'สรีรวิทยา',
      'เทคโนโลยีชีวภาพ',
      'กายวิภาคศาสตร์'
    ],
    'ดาราศาสตร์': [
      'กาแล็กซี',
      'นอกกาแล็กซี',
      'ดาวฤกษ์',
      'ดาวเคราะห์',
      'จักรวาลวิทยา',
      'ชีววิทยาโหราศาสตร์',
      'แอสโทรฟิสิกส์พลังงานสูง',
      'แอสโทรอินฟอร์แมตส์',
      'ฟิสิกส์ดาราศาสตร์โน้มถ่วง'
    ],
    'ธรณีวิทยา': [
      'ธรณีวิทยาฟิสิกส์',
      'แร่วิทยา',
      'หินวิทยา',
      'Structural',
      'Stratigraphy',
      'ธรณีฟิสิกส์',
      'ธรณีสัณฐานวิทยา',
      'ธรณีวิทยาสิ่งแวดล้อม'
    ]
  },
  'จิตวิทยา': [
    'จิตวิทยาทั่วไป',
    'จิตวิทยาการศึกษา',
    'จิตวิทยาคลินิก',
    'จิตวิทยาอุตสาหรรมและองค์กร',
    'จิตรวิทยาพัฒนาการ',
    'จิตวิทยาสังคม',
    'จิตวิทยาการทดลอง',
    'จิตวิทยาชุมชน',
    'จิตวิทยาการปรึกษา',
    'จิตวิทยาการแนะแนว'
  ],
};

Map<String, dynamic> skills = {
  'ศิลปะและการออกแบบ': [
    'สถาปัตยกรรม',
    'งานปั้น',
    'งานแกะสลัก',
    'งานหล่อ',
    'งานประกอบขึ้นรูป',
    'งานสัก',
    'การออกแบบ',
    'ภาษาและวรรณกรรม',
    'การพิมพ์ภาพ',
    'ตนตรีนาฏศิลป์',
    'มัณฑนศิลป์',
    'การแสดง',
    'Animating',
    'ดิจิทัลอาร์ต',
    'การถ่ายภาพ'
  ],
  'อาหาร': [
    'การทำอาหาร',
    'ธุรกิจอาหาร',
    'การวิจัยทางอาหาร',
    'การพัฒนาสูตรอาหาร',
    'การปรึกษาโภชนาการ',
  ],
  'กีฬาและสุขภาพ': {
    'ออกกำลังกาย': ['Weight', 'Training', 'Cardio', 'Stretching'],
    'กีฬา': [
      'ลู่ลาน/ความเร็ว',
      'ศิลปะการต่อสู้',
      'ตาข่าย/แร็กเก็ต',
      'ทีม/สนาม',
      'ประกวด',
      'อื่นๆ'
    ]
  },
  'กฎหมาย': [],
  'การเลี้ยงสัตว์': [
    'สัตว์บก',
    'สัตว์น้ำ',
    'สัตว์เลื้อยคลาน',
    'แมลง',
    'สัตว์ปีก',
    'สัตว์ครึ่งบกครึ่งน้ำ'
  ],
  'เทคโนโลยี': [
    'วิทยาการคอมพิวเตอร์',
    'วิศวกรรมคอมพิวเตอร์',
    'AI',
    'Cyber Security',
    'IOT',
    'ICT',
    'Metaverse',
    'Blockchain',
    'Robotic',
    'NanoTechnology',
    'Cloud',
    'Quantum Computing',
    'Data'
  ],
  'การแพทย์': [
    'เภสัชวิทยา',
    'ทัตแพทย์ศาสตร์',
    'วิทยาศาสตร์การแพทย์',
    'เลนส์สัมผัส',
    'พิษวิทยา',
    'กุมารเวชศาสตร์',
    'จักษุวิทยา',
    'จิตเวชศาสตร์',
    'พยาธิวิทยา',
    'นิติเวชศาตร์',
    'อายุรศาสตร์',
    'รังสีวิทยา',
    'วิสัญญีวิทยา',
    'เวชศาสตร์ครอบครัว',
    'เวชศาสตร์ป้องกัน',
    'เวชศาสตร์ฟื้นฟู',
    'ศัลยศาสตร์',
    'สูติศาสตร์-นรีเวชวิทยา',
    'โสตศอนาสิกวิทยา (ENT)',
    'ออร์โธปิดิกส์',
    'เวชศาสตร์ฉุกเฉิน (นิติศาสตร์)'
  ],
  'สื่อบันเทิง': [
    'ภาพยนตร์',
    'ดนตรี',
    'ละคร',
    'ซีรีส์',
    'การ์ตูน',
    'เกม',
    'influenser',
    'หนังสือ'
  ],
  'คณิตศาสตร์': [
    'การคำนวณ',
    'พีชคณิต',
    'เรขาคณิต',
    'ตรีโกณมิติ',
    'แคลตจัง',
    'Number Theory',
    'สถิติและความน่าจะเป็น',
    'Linear Algebra',
    'Differential Equation'
  ],
  'วิทยาศาสตร์': {
    'ฟิสิกส์': [
      'กลศาสตร์',
      'ไฟฟ้าและแม่เหล็ก',
      'เลนส์',
      'ฟิสิกข์นิวเครียร์',
      'เทอร์โมไดนามิกส์',
      'อนุภาค',
      'กลศาสตร์ควอนตัม',
      'ของไหล',
      'ทฤษฎีสัมพันธ์'
    ],
    'เคมี': [
      'เคมีอินทรีย์',
      'เคมีอนินทรีย์',
      'ชีวเคมี',
      'วิศวกรรมเคมี',
      'การวิเคราะห์ทางเคมี'
    ],
    'ชีววิทยา': [
      'พฤกษศาสตร์',
      'สัตววิทยา',
      'จุลวิทยา',
      'พันธุศาสตร์',
      'นิเวศวิทยา',
      'สรีรวิทยา',
      'เทคโนโลยีชีวภาพ',
      'กายวิภาคศาสตร์'
    ],
    'ดาราศาสตร์': [
      'กาแล็กซี',
      'นอกกาแล็กซี',
      'ดาวฤกษ์',
      'ดาวเคราะห์',
      'จักรวาลวิทยา',
      'ชีววิทยาโหราศาสตร์',
      'แอสโทรฟิสิกส์พลังงานสูง',
      'แอสโทรอินฟอร์แมตส์',
      'ฟิสิกส์ดาราศาสตร์โน้มถ่วง'
    ],
    'ธรณีวิทยา': [
      'ธรณีวิทยาฟิสิกส์',
      'แร่วิทยา',
      'หินวิทยา',
      'Structural',
      'Stratigraphy',
      'ธรณีฟิสิกส์',
      'ธรณีสัณฐานวิทยา',
      'ธรณีวิทยาสิ่งแวดล้อม'
    ]
  },
};
